vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXN527_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXN527</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXN527" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <sequences>
        <sequence name="EnableTraceClk">
          <block>
            __var SYSCON_NS_Base_Addr = 0x40000000;
            __var TRACECLKSEL_Addr    = SYSCON_NS_Base_Addr + 0x268;
            __var TRACECLKDIV_Addr    = SYSCON_NS_Base_Addr + 0x308;
            __var AHBCLKCTRLSET0_Addr = SYSCON_NS_Base_Addr + 0x220;
            __var clksel              = 0;
            __var clkdiv              = 0;
            
            // Program Funnel
            Write32(0xE0044FB0, 0xC5ACCE55);     // Unlock Funnel
            Write32(0xE0044000, 0x000003FF);     // CSTF [Program Funnel]
          </block>
          <control if="__traceout &amp; 0x3">
            <block>clksel = Read32(TRACECLKSEL_Addr);  // Read current TRACECLKSEL value</block>
            <control if="clksel &gt; 2" info="Trace (TPIU) Clock not selected?">
              <block>Write32(TRACECLKSEL_Addr, 0x0);   // Select Trace divided clock</block>
            </control>
            <block>
              clkdiv = (Read32(TRACECLKDIV_Addr) &amp; 0xFF);  // Read current TRACECLKDIV value, preserve divider but clear rest to enable
              Write32(TRACECLKDIV_Addr, clkdiv);
              
              Write32(AHBCLKCTRLSET0_Addr, (1 &lt;&lt; 13));   // Enable PORT0 clock
            </block>
          </control>
        </sequence>
        <sequence name="EnableDebugMailbox">
          <block>
            __var status=0x55aa;
            Message(0, "MCX connect script start");
            
            // Read APIDR
            __dp = 0;
            __ap = 2;
            status = ReadAP(0xFC);
            Message(0, "APIDR: 0x%08X", status);
            
            // Read DPIDR
            __dp = 0;
            __ap = 2;
            status = ReadDP(0x0);
            Message(0, "DPIDR: 0x%08X", status);
            
            // Active DebugMailbox
            __dp = 0;
            __ap = 2;
            WriteAP(0x0, 0x00000021);
            DAP_Delay(1000000);
            ReadAP(0x0);
            
            // Enter Debug Session
            __dp = 0;
            __ap = 2;
            WriteAP(0x4, 0x00000007);
            ReadAP(0x8);
            
            __dp = 0;
            __ap = 0;
            
            Message(0, "MCX connect script end");
          </block>
        </sequence>
        <sequence name="DebugPortStart">
          <block>
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0
            WriteDP(DP_SELECT, 0x00000000);
            
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block>
              // Request Debug/System Power-Up
              WriteDP(DP_CTRL_STAT, 0x50000000);
            </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block>
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
              </block>
            </control>
            <block>
              __var ap0_disable=0x55aa;
              // Read AP0 CSW
              __dp = 0;
              __ap = 0;
              ap0_disable = ReadAP(0x0);
              ap0_disable = ((ap0_disable &amp; 0x40) == 0);
            </block>
            <control if="ap0_disable">
              <block>Sequence("EnableDebugMailbox");</block>
            </control>
          </control>
          <block>
            __var SYSCON_NS_Base_Addr = 0x40000000;
            __var TRACECLKSEL_Addr    = SYSCON_NS_Base_Addr + 0x268;
            __var TRACECLKDIV_Addr    = SYSCON_NS_Base_Addr + 0x308;
            
            // config trace clock
            Write32(TRACECLKSEL_Addr, 0x0);   // Select Trace divided clock
            Write32(TRACECLKDIV_Addr, 0x2);   // Select Trace divided clock
          </block>
        </sequence>
        <sequence name="DebugDeviceUnlockCore0">
          <control if="__traceout &amp; 0x3" info="Trace output via TPIU selected">
            <block>
              Sequence("EnableTraceClk");       // Enable trace clock to enable TPIU register accesses
            </block>
          </control>
        </sequence>
        <sequence name="ResetCatchSetCore0">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DEMCR_Addr  = SCS_Addr + 0xDFC;
            __var resetVector = 0xFFFFFFFF;                                    // Reset Vector
            __var resetVector_Addr = 0x00000004;
            
            Write32(0xE000EDFC, Read32(DEMCR_Addr) &amp; (~0x00000001));       // Clear Reset Vector Catch
            
            Write32(0x40034010, 0x00000000);                                   // Program Flash Word Start Address to 0x0 to read reset vector (STARTA)
            Write32(0x40034014, 0x00000000);                                   // Program Flash Word Stop Address to 0x0 to read reset vector (STOPA)
            Write32(0x40034080, 0x00000000);                                   // DATAW0: Prepare for read
            Write32(0x40034084, 0x00000000);                                   // DATAW1: Prepare for read
            Write32(0x40034088, 0x00000000);                                   // DATAW2: Prepare for read
            Write32(0x4003408C, 0x00000000);                                   // DATAW3: Prepare for read
            Write32(0x40034090, 0x00000000);                                   // DATAW4: Prepare for read
            Write32(0x40034094, 0x00000000);                                   // DATAW5: Prepare for read
            Write32(0x40034098, 0x00000000);                                   // DATAW6: Prepare for read
            Write32(0x4003409C, 0x00000000);                                   // DATAW7: Prepare for read
            
            Write32(0x40034FE8, 0x0000000F);                                   // Clear FLASH Controller Status (INT_CLR_STATUS)
            Write32(0x40034000, 0x00000003);                                   // Read single Flash Word (CMD_READ_SINGLE_WORD)
          </block>
          <control if="((Read32(0x40120FFC) &amp; 0xC) != 0x8) || ((Read32(0x40120FF8) &amp; 0xC) != 0x8)">
            <block>
              // ENABLE_SECURE_CHECKING is set to restrictive mode, access secure addresses
              resetVector_Addr = 0x10000004;
            </block>
          </control>
          <block>
            // Lowest flash page readable, read via AHB (flash controller for some reason returns garbage)
            resetVector = Read32(resetVector_Addr);                                // Read Reset Vector (Address 0x00000004)
          </block>
          <control if="resetVector != 0xFFFFFFFF" info="Breakpoint on user application reset vector">
            <!-- we have a valid breakpoint address -->
            <block>
              Write32(0xE0002008, resetVector|1);                              // Program FPB Comparator 0 with reset handler address
              Write32(0xE0002000, 0x00000003);                                 // Enable FPB
            </block>
          </control>
          <control if="resetVector == 0xFFFFFFFF" info="Enable reset vector catch">
            <!-- we do not have a valid breakpoint address -->
            <block>
              Write32(DEMCR_Addr, (Read32(DEMCR_Addr) | 0x00000001));          // Enable Reset Vector Catch in DEMCR
            </block>
          </control>
          <block>
            // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            Read32(DHCSR_Addr);
          </block>
        </sequence>
        <sequence name="ResetCatchSetCore1">
          <block>
            // Use DEMCR.VC_CORERESET for CPU1
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            
            // Enable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value | 0x00000001));
            // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            Read32(DHCSR_Addr);
          </block>
        </sequence>
        <sequence name="ResetCatchClear">
          <block>
            __var DEMCR_Addr = 0xE000EDFC;
            
            // Clear FPB Comparators 0 and 1
            Write32(0xE0002008, 0x00000000);
            
            // Disable FPB
            Write32(0xE0002000, 0x00000002);
            
            // Clear Reset Vector Catch
            Write32(DEMCR_Addr, Read32(DEMCR_Addr) &amp; (~0x00000001));
          </block>
        </sequence>
        <sequence name="WaitForStopAfterReset">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DFSR_Addr  = SCS_Addr + 0xD30;
          </block>
          <!-- Check AHB-AP CSW DbgStatus to decide if the ROM finished preparation. -->
          <control while="(ReadAP(0) &amp; 0x40) == 0" timeout="500000"/>
          <control while="(ReadAP(0) &amp; 0x40) == 0" timeout="100000">
            <block>
              <!-- Sequence("EnableDebugMailbox"); -->
              Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
              // Clear watch point
              Write32(0xE0001028, 0x0);
              Write32(0xE0001038, 0x0);
              Write32(0xE0001048, 0x0);
              Write32(0xE0001058, 0x0);
            </block>
          </control>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          <control if="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0">
            <block>
              Write32(DHCSR_Addr, 0xA05F0003);  // Force halt until finding a proper catch. Probably works better from flash.
            </block>
          </control>
        </sequence>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DEMCR_Addr  = SCS_Addr + 0xDFC;
            __var tmp;
            
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            
