vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cache_cache64.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cache_lpcac_n4a_mcxn.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov5640.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7670.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.mcx_spc, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mcx_spc, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_gpio.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXN527.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="GPIO" Capiversion="1.0.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MCXN527, device.RTE, device_id=MCXN527, driver.lpflexcomm_lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpflexcomm_lpi2c, device_id=MCXN527, device.RTE, device_id=MCXN527, driver.lpflexcomm_lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MCXN527.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXN527.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpi2c, device_id=MCXN527.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpi2c, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpi2c, device_id=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MCXN527, device.RTE, device_id=MCXN527, driver.lpflexcomm_lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpflexcomm_lpspi, device_id=MCXN527, device.RTE, device_id=MCXN527, driver.lpflexcomm_lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MCXN527.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXN527.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpflexcomm_lpspi, device_id=MCXN527.internal_condition">
      <accept condition="allOf.driver.lpflexcomm_lpspi, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm_lpspi, device_id=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
