vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
    <condition id="driver.flexspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexspi, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexspi, device=MCXN527.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.ft5406_rt.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpflexcomm_lpi2c, device=MCXN527.internal_condition">
      <require condition="anyOf.driver.lpflexcomm_lpi2c.internal_condition"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MCXN527.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.gdet.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.i3c, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpflexcomm_lpi2c, driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.intm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.irtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.itrc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpc_freqme.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpi2c.condition_id">
      <require condition="allOf.driver.lpflexcomm, device_id=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpflexcomm, device_id=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpflexcomm"/>
      <require condition="device_id.MCXN527.internal_condition"/>
    </condition>
    <condition id="driver.lpflexcomm_lpi2c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN527.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.lpflexcomm_lpi2c, device=MCXN527.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c"/>
      <require condition="device.MCXN527.internal_condition"/>
    </condition>
