vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_random_modes" Cversion="1.9.0" condition="component.els_pkc.random_modes.condition_id">
      <description>Component els_pkc.random_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_Els.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_ElsMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PatchMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_TestMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_SizeDefinitions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg_BlockCipher.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_Drbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_NormalMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PatchMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PrDisabled.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_TestMode.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_random_modes_ctr" Cversion="1.9.0" condition="component.els_pkc.random_modes_ctr.condition_id">
      <description>Component els_pkc.random_modes_ctr</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PrDisabled.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_random_modes_hmacdrbg" Cversion="1.9.0" condition="component.els_pkc.random_modes_hmacdrbg.condition_id">
      <description>Component els_pkc.random_modes_hmacdrbg</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_HmacDrbg.c" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_HmacDrbg_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_HmacDrbg.h" projectpath="component/els_pkc/src/comps/mcuxClRandomModes/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_rsa" Cversion="1.9.0" condition="component.els_pkc.rsa.condition_id">
      <description>Component els_pkc.rsa</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_GenerateProbablePrime.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_getMillerRabinTestIterations.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Crt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Crt_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Helper.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Plain.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Mgf1.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModInv.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Encode_sign.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Verify.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivatePlain.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssEncode.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssVerify.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Public.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PublicExp.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Sign.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Sign_NoEMSA.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate_FUP.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Verify.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_VerifyE.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Verify_NoEMSA.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ComputeD_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_KeyGeneration_Crt_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_MillerRabinTest_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_PrivateCrt_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_RemoveBlinding_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPQDistance_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPrimeCandidate_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_ComputeD_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_MemoryConsumption.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcDefs.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcTypes.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Types.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_KeyGeneration_Crt_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_MillerRabinTest_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_PrivateCrt_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_RemoveBlinding_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPQDistance_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPrimeCandidate_FUP.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_rsa_oaep" Cversion="1.9.0" condition="component.els_pkc.rsa_oaep.condition_id">
      <description>Component els_pkc.rsa_oaep</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyTypes.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModeConstructors.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_OaepDecode.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_OaepEncode.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_pkcs1v15Decode_decrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Encode_encrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Decrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Util_Encrypt.c" projectpath="component/els_pkc/src/comps/mcuxClRsa/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_KeyTypes.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ModeConstructors.h" projectpath="component/els_pkc/src/comps/mcuxClRsa/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_secure_counter" Cversion="1.9.0" condition="component.els_pkc.secure_counter.condition_id">
      <description>Component els_pkc.secure_counter</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_None.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_SW_Local.h" projectpath="component/els_pkc/src/comps/mcuxCsslSecureCounter/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN527 els_pkc" Cgroup="els_pkc_session" Cversion="1.9.0" condition="component.els_pkc.session.condition_id">
      <description>Component els_pkc.session</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/els_pkc/src/comps/mcuxClSession/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_RegularReturn.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
