vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN527_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXN527_cmsis</description>
      <files>
        <file category="header" name="devices/MCXN527/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core0_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core0_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXN527/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_AHBSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_BSP32.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_DIGTMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_DM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_EMVSIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_EVTG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_FMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_FMUTEST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_GDET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_HPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_INTM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_ITRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPCMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPDAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_LP_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_NPX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_OPAMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_OTPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PKC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PLU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_QDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_S50.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SCG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SINC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SMARTDMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SYSCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_TSI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USBDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USBHS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_VBAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_VREF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_WUU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXN527/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core1.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core1_COMMON.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN527/MCXN527_cm33_core1_features.h" projectpath="device"/>
        <file category="include" name="devices/MCXN527/"/>
        <file category="include" name="devices/MCXN527/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN527/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN527/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXN527_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXN527_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core0_flash.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core0_flash_ns.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core0_flash_s.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core0_ram.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core1_flash.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/arm/MCXN527_cm33_core1_ram.scf" version="1.0.0" projectpath="MCXN527/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core0_flash.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core0_flash_ns.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core0_flash_s.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core0_ram.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core1_flash.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/gcc/MCXN527_cm33_core1_ram.ld" version="1.0.0" projectpath="MCXN527/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core0_flash.icf" version="1.0.0" projectpath="MCXN527/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core0_flash_ns.icf" version="1.0.0" projectpath="MCXN527/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core0_flash_s.icf" version="1.0.0" projectpath="MCXN527/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core0_ram.icf" version="1.0.0" projectpath="MCXN527/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core1_flash.icf" version="1.0.0" projectpath="MCXN527/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN527.condition_id" category="linkerScript" attr="config" name="devices/MCXN527/iar/MCXN527_cm33_core1_ram.icf" version="1.0.0" projectpath="MCXN527/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXN527" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXN527</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN527/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN527/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN527/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN527/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN527/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN527/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN527/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN527/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN527/project_template/"/>
      </files>
    </component>
