vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN527_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.5" condition="driver.mrt.condition_id">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_mrt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_mrt.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="npx" Cversion="2.0.0" condition="driver.npx.condition_id">
      <description>NPX Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_npx.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN527/drivers/fsl_npx.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="opamp" Cversion="2.2.1" condition="driver.opamp.condition_id">
      <description>OPAMP Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_opamp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_opamp.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.5" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="otp" Cversion="2.0.1" condition="driver.otp.condition_id">
      <description>OTP Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_otp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x" Cversion="2.0.1" condition="driver.pcm186x.condition_id">
      <description>Driver pcm186x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM186X_ENABLE
#define CODEC_PCM186X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm186x/fsl_pcm186x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm186x/fsl_pcm186x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm186x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x" Cversion="2.0.1" condition="driver.pcm512x.condition_id">
      <description>Driver pcm512x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM512X_ENABLE
#define CODEC_PCM512X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm512x/fsl_pcm512x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm512x/fsl_pcm512x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm512x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550.h" projectpath="component/pmic/pf1550"/>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550_charger.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550_charger.h" projectpath="component/pmic/pf1550"/>
        <file category="include" name="components/pmic/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="sourceC" name="components/pmic/pf3000/fsl_pf3000.c" projectpath="component/pmic/pf3000"/>
        <file category="header" name="components/pmic/pf3000/fsl_pf3000.h" projectpath="component/pmic/pf3000"/>
        <file category="include" name="components/pmic/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf5020" Cversion="2.0.0" condition="driver.pf5020.condition_id">
      <description>Driver pf5020</description>
      <files>
        <file category="sourceC" name="components/pmic/pf5020/fsl_pf5020.c" projectpath="component/pmic/pf5020"/>
        <file category="header" name="components/pmic/pf5020/fsl_pf5020.h" projectpath="component/pmic/pf5020"/>
        <file category="include" name="components/pmic/pf5020/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.2.0" condition="driver.pint.condition_id">
      <description>PINT Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_pint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_pint.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="plu" Cversion="2.2.1" condition="driver.plu.condition_id">
      <description>PLU Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_plu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_plu.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="port" Cversion="2.5.1" condition="driver.port.condition_id">
      <description>PORT Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_port.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="powerquad" Cversion="2.2.0" condition="driver.powerquad.condition_id">
      <description>POWERQUAD Driver</description>
      <files>
        <file category="header" name="devices/MCXN527/drivers/fsl_powerquad_data.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_data.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN527/drivers/fsl_powerquad.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_basic.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_math.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_matrix.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_filter.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN527/drivers/fsl_powerquad_transform.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN527/drivers/"/>
      </files>
    </component>
